// Laba2


//#define _CRT_SECURE_NO_WARNINGS                                         //для возможности использования scanf

#include <iostream>
#include <stdio.h>
#include <conio.h>
#include <windows.h>
#include <locale.h>
using namespace std;

int main() {

	setlocale(LC_ALL, "Russian");           //русский шрифт в консольном окне 
	SetConsoleOutputCP(1251);
	SetConsoleCP(1251);

	 //system("chcp 1251");                 // настраиваем кодировку консоли

	char name1[9], name2[9], name3[9];
	char v1, v2, v3;
	int sq1, sq2, sq3;
	int cnt1, cnt2, cnt3;

	cout << "Привет\n\n";

	// Введение фактических данных
	printf("1.Введите: название, вид, площадь, количество > ");
	scanf("%9s %1c %3d %3d", name1, &v1, &sq1, &cnt1);                      // %s-строка символов, %c-символ типа char, 
	printf("2.Введите: название, вид, площадь, количество > ");             // %d-десятичное число целого типа со знаком 
	scanf("%9s %1c %3d %3d", name2, &v2, &sq2, &cnt2);
	printf("3.Введите: название, вид, площадь, количество > ");
	scanf("%9s %1c %3d %3d", name3, &v3, &sq3, &cnt3);


	// Вывод таблицы 

	// вывод заголовков
	printf("-------------------------------------------------\n");
	printf("|        Сельскохозяйственные предприятия       |\n");
	printf("|-----------------------------------------------|\n");
	printf("| Название | Вид         | Площадь  |Количество |\n");
	printf("|          |собственности| земли(га)|работников |\n");
	printf("|----------|-------------|----------|-----------|\n");

	// вывод строк фактических данных 
	printf("| %8s | %11c | %8d | %9d |\n", name1, v1, sq1, cnt1);
	printf("| %8s | %11c | %8d | %9d |\n", name2, v2, sq2, cnt2);
	printf("| %8s | %11c | %8d | %9d |\n", name3, v3, sq3, cnt3);

	// вывод примечаний 
	printf("|-----------------------------------------------|\n");
	printf("| Вид собственности: Д - государственная,       |\n");
	printf("|    Ч - частная, К - кооператвная              |\n");
	printf("-------------------------------------------------\n");

	system("pause");

	return 0;
}